Revit 2027 API
ParameterTypeId.ViewType Property
 "Family and Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewType { get; }
Public Shared ReadOnly Property ViewType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewType {
	ForgeTypeId^ get ();
}
static member ViewType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace